avrdudes/avr-libc/include/avr/ioavr16eb32.h
/* Crystal startup time select bit group configurations*/
typedef enum CLKCTRL_CSUT_enum
{
    CLKCTRL_CSUT_1K_gc             = (CLKCTRL_CSUT_1K_gv << CLKCTRL_CSUT_gp),  /* 1k cycles */
    CLKCTRL_CSUT_16K_gc            = (CLKCTRL_CSUT_16K_gv << CLKCTRL_CSUT_gp),  /* 16k cycles */
    CLKCTRL_CSUT_32K_gc            = (CLKCTRL_CSUT_32K_gv << CLKCTRL_CSUT_gp),  /* 32k cycles */
    CLKCTRL_CSUT_64K_gc            = (CLKCTRL_CSUT_64K_gv << CLKCTRL_CSUT_gp)   /* 64k cycles */
} CLKCTRL_CSUT_t;

/* PLL Multiplication Factor select bit group values */
typedef enum CLKCTRL_MULFAC_VALUES_enum
{
    CLKCTRL_MULFAC_OFF_gv          = 0x00,  /* PLL Disabled */
    CLKCTRL_MULFAC_8X_gv           = 0x02,  /* Multiply by 8 */
    CLKCTRL_MULFAC_16X_gv          = 0x03   /* Multiply by 16 */
} CLKCTRL_MULFAC_values_t;

/* PLL Multiplication Factor select bit group configurations*/
typedef enum CLKCTRL_MULFAC_enum
{
    CLKCTRL_MULFAC_OFF_gc          = (CLKCTRL_MULFAC_OFF_gv << CLKCTRL_MULFAC_gp),  /* PLL Disabled */
    CLKCTRL_MULFAC_8X_gc           = (CLKCTRL_MULFAC_8X_gv << CLKCTRL_MULFAC_gp),  /* Multiply by 8 */
    CLKCTRL_MULFAC_16X_gc          = (CLKCTRL_MULFAC_16X_gv << CLKCTRL_MULFAC_gp)   /* Multiply by 16 */
} CLKCTRL_MULFAC_t;

/* Prescaler B division select bit group values */
typedef enum CLKCTRL_PBDIV_VALUES_enum
{
    CLKCTRL_PBDIV_NONE_gv          = 0x00,  /* No division */
    CLKCTRL_PBDIV_DIV4_gv          = 0x01   /* Divide by 4 */
} CLKCTRL_PBDIV_values_t;

/* Prescaler B division select bit group configurations*/
typedef enum CLKCTRL_PBDIV_enum
{
    CLKCTRL_PBDIV_NONE_gc          = (CLKCTRL_PBDIV_NONE_gv << CLKCTRL_PBDIV_bp),  /* No division */
    CLKCTRL_PBDIV_DIV4_gc          = (CLKCTRL_PBDIV_DIV4_gv << CLKCTRL_PBDIV_bp)   /* Divide by 4 */
} CLKCTRL_PBDIV_t;

/* Prescaler division select bit group values */
typedef enum CLKCTRL_PDIV_VALUES_enum
{
    CLKCTRL_PDIV_DIV2_gv           = 0x00,  /* Divide by 2 */
    CLKCTRL_PDIV_DIV4_gv           = 0x01,  /* Divide by 4 */
    CLKCTRL_PDIV_DIV8_gv           = 0x02,  /* Divide by 8 */
    CLKCTRL_PDIV_DIV16_gv          = 0x03,  /* Divide by 16 */
    CLKCTRL_PDIV_DIV32_gv          = 0x04,  /* Divide by 32 */
    CLKCTRL_PDIV_DIV64_gv          = 0x05,  /* Divide by 64 */
    CLKCTRL_PDIV_DIV6_gv           = 0x08,  /* Divide by 6 */
    CLKCTRL_PDIV_DIV10_gv          = 0x09,  /* Divide by 10 */
    CLKCTRL_PDIV_DIV12_gv          = 0x0A,  /* Divide by 12 */
    CLKCTRL_PDIV_DIV24_gv          = 0x0B,  /* Divide by 24 */
    CLKCTRL_PDIV_DIV48_gv          = 0x0C   /* Divide by 48 */
} CLKCTRL_PDIV_values_t;

/* Prescaler division select bit group configurations*/
typedef enum CLKCTRL_PDIV_enum
{
    CLKCTRL_PDIV_DIV2_gc           = (CLKCTRL_PDIV_DIV2_gv << CLKCTRL_PDIV_gp),  /* Divide by 2 */
    CLKCTRL_PDIV_DIV4_gc           = (CLKCTRL_PDIV_DIV4_gv << CLKCTRL_PDIV_gp),  /* Divide by 4 */
    CLKCTRL_PDIV_DIV8_gc           = (CLKCTRL_PDIV_DIV8_gv << CLKCTRL_PDIV_gp),  /* Divide by 8 */
    CLKCTRL_PDIV_DIV16_gc          = (CLKCTRL_PDIV_DIV16_gv << CLKCTRL_PDIV_gp),  /* Divide by 16 */
    CLKCTRL_PDIV_DIV32_gc          = (CLKCTRL_PDIV_DIV32_gv << CLKCTRL_PDIV_gp),  /* Divide by 32 */
    CLKCTRL_PDIV_DIV64_gc          = (CLKCTRL_PDIV_DIV64_gv << CLKCTRL_PDIV_gp),  /* Divide by 64 */
    CLKCTRL_PDIV_DIV6_gc           = (CLKCTRL_PDIV_DIV6_gv << CLKCTRL_PDIV_gp),  /* Divide by 6 */
    CLKCTRL_PDIV_DIV10_gc          = (CLKCTRL_PDIV_DIV10_gv << CLKCTRL_PDIV_gp),  /* Divide by 10 */
    CLKCTRL_PDIV_DIV12_gc          = (CLKCTRL_PDIV_DIV12_gv << CLKCTRL_PDIV_gp),  /* Divide by 12 */
    CLKCTRL_PDIV_DIV24_gc          = (CLKCTRL_PDIV_DIV24_gv << CLKCTRL_PDIV_gp),  /* Divide by 24 */
    CLKCTRL_PDIV_DIV48_gc          = (CLKCTRL_PDIV_DIV48_gv << CLKCTRL_PDIV_gp)   /* Divide by 48 */
} CLKCTRL_PDIV_t;

/* PLL Source select bit group values */
typedef enum CLKCTRL_SOURCE_VALUES_enum
{
    CLKCTRL_SOURCE_OSCHF_gv        = 0x00,  /* Internal High Frequency Oscillator */
    CLKCTRL_SOURCE_EXTCLK_gv       = 0x01   /* External Clock */
} CLKCTRL_SOURCE_values_t;

/* PLL Source select bit group configurations*/
typedef enum CLKCTRL_SOURCE_enum
{
    CLKCTRL_SOURCE_OSCHF_gc        = (CLKCTRL_SOURCE_OSCHF_gv << CLKCTRL_SOURCE_gp),  /* Internal High Frequency Oscillator */
    CLKCTRL_SOURCE_EXTCLK_gc       = (CLKCTRL_SOURCE_EXTCLK_gv << CLKCTRL_SOURCE_gp)   /* External Clock */
} CLKCTRL_SOURCE_t;

/* PLL Source Division select bit group values */
typedef enum CLKCTRL_SOURCEDIV_VALUES_enum
{
    CLKCTRL_SOURCEDIV_DIV1_gv      = 0x00,  /* Source undivided */
    CLKCTRL_SOURCEDIV_DIV2_gv      = 0x01,  /* Divide source by 2 */
    CLKCTRL_SOURCEDIV_DIV4_gv      = 0x02,  /* Divide source by 4 */
    CLKCTRL_SOURCEDIV_DIV6_gv      = 0x03   /* Divide source by 6 */
} CLKCTRL_SOURCEDIV_values_t;

/* PLL Source Division select bit group configurations*/
typedef enum CLKCTRL_SOURCEDIV_enum
{
    CLKCTRL_SOURCEDIV_DIV1_gc      = (CLKCTRL_SOURCEDIV_DIV1_gv << CLKCTRL_SOURCEDIV_gp),  /* Source undivided */
    CLKCTRL_SOURCEDIV_DIV2_gc      = (CLKCTRL_SOURCEDIV_DIV2_gv << CLKCTRL_SOURCEDIV_gp),  /* Divide source by 2 */
    CLKCTRL_SOURCEDIV_DIV4_gc      = (CLKCTRL_SOURCEDIV_DIV4_gv << CLKCTRL_SOURCEDIV_gp),  /* Divide source by 4 */
    CLKCTRL_SOURCEDIV_DIV6_gc      = (CLKCTRL_SOURCEDIV_DIV6_gv << CLKCTRL_SOURCEDIV_gp)   /* Divide source by 6 */
} CLKCTRL_SOURCEDIV_t;

/*
--------------------------------------------------------------------------
CPU - CPU
--------------------------------------------------------------------------
*/

#define CORE_VERSION  V4S

/* CCP signature select bit group values */
typedef enum CCP_VALUES_enum
{
    CCP_SPM_gv                     = 0x9D,  /* SPM Instruction Protection */
    CCP_IOREG_gv                   = 0xD8   /* IO Register Protection */
} CCP_values_t;

/* CCP signature select bit group configurations*/
typedef enum CCP_enum
{
    CCP_SPM_gc                     = (CCP_SPM_gv << CPU_CCP_gp),  /* SPM Instruction Protection */
    CCP_IOREG_gc                   = (CCP_IOREG_gv << CPU_CCP_gp)   /* IO Register Protection */
} CCP_t;

