avrdudes/avr-libc/include/avr/ioavr16eb32.h
/*
--------------------------------------------------------------------------
TCF - 24-bit Timer/Counter for frequency generation
--------------------------------------------------------------------------
*/

/* 24-bit Timer/Counter for frequency generation */
typedef struct TCF_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t EVCTRL;  /* Event Control */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status */
    register8_t reserved_1[5];
    register8_t DBGCTRL;  /* Debug Control */
    register8_t reserved_2[2];
    _DWORDREGISTER(CNT);  /* Count */
    _DWORDREGISTER(CMP);  /* Compare */
    register8_t reserved_3[8];
} TCF_t;

/* Clock Select bit group values */
typedef enum TCF_CLKSEL_VALUES_enum
{
    TCF_CLKSEL_CLKPER_gv           = 0x00,  /* Peripheral Clock */
    TCF_CLKSEL_EVENT_gv            = 0x01,  /* Event as clock source */
    TCF_CLKSEL_OSCHF_gv            = 0x02,  /* Internal High Frequency Oscillator */
    TCF_CLKSEL_OSC32K_gv           = 0x03,  /* Internal 32.768 kHz Oscillator */
    TCF_CLKSEL_PLL_gv              = 0x05   /* PLL */
} TCF_CLKSEL_values_t;

/* Clock Select bit group configurations*/
typedef enum TCF_CLKSEL_enum
{
    TCF_CLKSEL_CLKPER_gc           = (TCF_CLKSEL_CLKPER_gv << TCF_CLKSEL_gp),  /* Peripheral Clock */
    TCF_CLKSEL_EVENT_gc            = (TCF_CLKSEL_EVENT_gv << TCF_CLKSEL_gp),  /* Event as clock source */
    TCF_CLKSEL_OSCHF_gc            = (TCF_CLKSEL_OSCHF_gv << TCF_CLKSEL_gp),  /* Internal High Frequency Oscillator */
    TCF_CLKSEL_OSC32K_gc           = (TCF_CLKSEL_OSC32K_gv << TCF_CLKSEL_gp),  /* Internal 32.768 kHz Oscillator */
    TCF_CLKSEL_PLL_gc              = (TCF_CLKSEL_PLL_gv << TCF_CLKSEL_gp)   /* PLL */
} TCF_CLKSEL_t;

/* Command select bit group values */
typedef enum TCF_CMD_VALUES_enum
{
    TCF_CMD_NONE_gv                = 0x00,  /* No command */
    TCF_CMD_UPDATE_gv              = 0x01,  /* Force update */
    TCF_CMD_RESTART_gv             = 0x02   /* Force restart */
} TCF_CMD_values_t;

/* Command select bit group configurations*/
typedef enum TCF_CMD_enum
{
    TCF_CMD_NONE_gc                = (TCF_CMD_NONE_gv << TCF_CMD_gp),  /* No command */
    TCF_CMD_UPDATE_gc              = (TCF_CMD_UPDATE_gv << TCF_CMD_gp),  /* Force update */
    TCF_CMD_RESTART_gc             = (TCF_CMD_RESTART_gv << TCF_CMD_gp)   /* Force restart */
} TCF_CMD_t;

/* Compare # Event Generation select bit group values */
typedef enum TCF_CMP0EV_VALUES_enum
{
    TCF_CMP0EV_PULSE_gv            = 0x00,  /* Event is generated as pulse */
    TCF_CMP0EV_WAVEFORM_gv         = 0x01   /* Waveform is used as event output */
} TCF_CMP0EV_values_t;

/* Compare # Event Generation select bit group configurations*/
typedef enum TCF_CMP0EV_enum
{
    TCF_CMP0EV_PULSE_gc            = (TCF_CMP0EV_PULSE_gv << TCF_CMP0EV_bp),  /* Event is generated as pulse */
    TCF_CMP0EV_WAVEFORM_gc         = (TCF_CMP0EV_WAVEFORM_gv << TCF_CMP0EV_bp)   /* Waveform is used as event output */
} TCF_CMP0EV_t;

/* Compare # Event Generation select bit group values */
typedef enum TCF_CMP1EV_VALUES_enum
{
    TCF_CMP1EV_PULSE_gv            = 0x00,  /* Event is generated as pulse */
    TCF_CMP1EV_WAVEFORM_gv         = 0x01   /* Waveform is used as event output */
} TCF_CMP1EV_values_t;

/* Compare # Event Generation select bit group configurations*/
typedef enum TCF_CMP1EV_enum
{
    TCF_CMP1EV_PULSE_gc            = (TCF_CMP1EV_PULSE_gv << TCF_CMP1EV_bp),  /* Event is generated as pulse */
    TCF_CMP1EV_WAVEFORM_gc         = (TCF_CMP1EV_WAVEFORM_gv << TCF_CMP1EV_bp)   /* Waveform is used as event output */
} TCF_CMP1EV_t;

/* Event Action A select bit group values */
typedef enum TCF_EVACTA_VALUES_enum
{
    TCF_EVACTA_RESTART_gv          = 0x00,  /* Restart Counter */
    TCF_EVACTA_BLANK_gv            = 0x01   /* Mask waveform output to '0' */
} TCF_EVACTA_values_t;

/* Event Action A select bit group configurations*/
typedef enum TCF_EVACTA_enum
{
    TCF_EVACTA_RESTART_gc          = (TCF_EVACTA_RESTART_gv << TCF_EVACTA_gp),  /* Restart Counter */
    TCF_EVACTA_BLANK_gc            = (TCF_EVACTA_BLANK_gv << TCF_EVACTA_gp)   /* Mask waveform output to '0' */
} TCF_EVACTA_t;

/* Clock Prescaler select bit group values */
typedef enum TCF_PRESC_VALUES_enum
{
    TCF_PRESC_DIV1_gv              = 0x00,  /* Runs directly on Clock Source */
    TCF_PRESC_DIV2_gv              = 0x01,  /* Divide clock source by 2 */
    TCF_PRESC_DIV4_gv              = 0x02,  /* Divide clock source by 4 */
    TCF_PRESC_DIV8_gv              = 0x03,  /* Divide clock source by 8 */
    TCF_PRESC_DIV16_gv             = 0x04,  /* Divide clock source by 16 */
    TCF_PRESC_DIV32_gv             = 0x05,  /* Divide clock source by 32 */
    TCF_PRESC_DIV64_gv             = 0x06,  /* Divide clock source by 64 */
    TCF_PRESC_DIV128_gv            = 0x07   /* Divide clock source by 128 */
} TCF_PRESC_values_t;

/* Clock Prescaler select bit group configurations*/
typedef enum TCF_PRESC_enum
{
    TCF_PRESC_DIV1_gc              = (TCF_PRESC_DIV1_gv << TCF_PRESC_gp),  /* Runs directly on Clock Source */
    TCF_PRESC_DIV2_gc              = (TCF_PRESC_DIV2_gv << TCF_PRESC_gp),  /* Divide clock source by 2 */
    TCF_PRESC_DIV4_gc              = (TCF_PRESC_DIV4_gv << TCF_PRESC_gp),  /* Divide clock source by 4 */
    TCF_PRESC_DIV8_gc              = (TCF_PRESC_DIV8_gv << TCF_PRESC_gp),  /* Divide clock source by 8 */
    TCF_PRESC_DIV16_gc             = (TCF_PRESC_DIV16_gv << TCF_PRESC_gp),  /* Divide clock source by 16 */
    TCF_PRESC_DIV32_gc             = (TCF_PRESC_DIV32_gv << TCF_PRESC_gp),  /* Divide clock source by 32 */
    TCF_PRESC_DIV64_gc             = (TCF_PRESC_DIV64_gv << TCF_PRESC_gp),  /* Divide clock source by 64 */
    TCF_PRESC_DIV128_gc            = (TCF_PRESC_DIV128_gv << TCF_PRESC_gp)   /* Divide clock source by 128 */
} TCF_PRESC_t;

