avrdudes/avr-libc/include/avr/ioavr16eb32.h
/*
--------------------------------------------------------------------------
WEX - Waveform Extension
--------------------------------------------------------------------------
*/

/* Waveform Extension */
typedef struct WEX_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t reserved_1[1];
    register8_t EVCTRLA;  /* Event Control A */
    register8_t EVCTRLB;  /* Event Control B */
    register8_t EVCTRLC;  /* Event Control C */
    register8_t BUFCTRL;  /* Buffer Valid Control */
    register8_t BLANKCTRL;  /* Blanking Control */
    register8_t BLANKTIME;  /* Blanking Time */
    register8_t FAULTCTRL;  /* Fault Control */
    register8_t FAULTDRV;  /* Fault Drive */
    register8_t FAULTOUT;  /* Fault Output */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t STATUS;  /* Status */
    register8_t DTLS;  /* Dead-time Low Side */
    register8_t DTHS;  /* Dead-time High Side */
    register8_t DTBOTH;  /* Dead-time Both Sides */
    register8_t SWAP;  /* DTI Swap */
    register8_t PGMOVR;  /* Pattern Generation Override */
    register8_t PGMOUT;  /* Pattern Generation Output */
    register8_t reserved_2[1];
    register8_t OUTOVEN;  /* Output Override Enable */
    register8_t DTLSBUF;  /* Dead-time Low Side Buffer */
    register8_t DTHSBUF;  /* Dead-time High Side Buffer */
    register8_t DTBOTHBUF;  /* Dead-time Both Sides Buffer */
    register8_t SWAPBUF;  /* DTI Swap Buffer */
    register8_t PGMOVRBUF;  /* Pattern Generation Override Buffer */
    register8_t PGMOUTBUF;  /* Pattern Generation Output Buffer */
    register8_t reserved_3[2];
} WEX_t;

/* Blanking Prescaler select bit group values */
typedef enum WEX_BLANKPRESC_VALUES_enum
{
    WEX_BLANKPRESC_DIV1_gv         = 0x00,  /* No prescaling */
    WEX_BLANKPRESC_DIV4_gv         = 0x01,  /* Divide CLK_PER by 4 */
    WEX_BLANKPRESC_DIV16_gv        = 0x02,  /* Divide CLK_PER by 16 */
    WEX_BLANKPRESC_DIV64_gv        = 0x03   /* Divide CLK_PER by 64 */
} WEX_BLANKPRESC_values_t;

/* Blanking Prescaler select bit group configurations*/
typedef enum WEX_BLANKPRESC_enum
{
    WEX_BLANKPRESC_DIV1_gc         = (WEX_BLANKPRESC_DIV1_gv << WEX_BLANKPRESC_gp),  /* No prescaling */
    WEX_BLANKPRESC_DIV4_gc         = (WEX_BLANKPRESC_DIV4_gv << WEX_BLANKPRESC_gp),  /* Divide CLK_PER by 4 */
    WEX_BLANKPRESC_DIV16_gc        = (WEX_BLANKPRESC_DIV16_gv << WEX_BLANKPRESC_gp),  /* Divide CLK_PER by 16 */
    WEX_BLANKPRESC_DIV64_gc        = (WEX_BLANKPRESC_DIV64_gv << WEX_BLANKPRESC_gp)   /* Divide CLK_PER by 64 */
} WEX_BLANKPRESC_t;

/* Blanking State select bit group values */
typedef enum WEX_BLANKSTATE_VALUES_enum
{
    WEX_BLANKSTATE_OFF_gv          = 0x00,  /* Blanking off */
    WEX_BLANKSTATE_ON_gv           = 0x01   /* Blanking active */
} WEX_BLANKSTATE_values_t;

/* Blanking State select bit group configurations*/
typedef enum WEX_BLANKSTATE_enum
{
    WEX_BLANKSTATE_OFF_gc          = (WEX_BLANKSTATE_OFF_gv << WEX_BLANKSTATE_bp),  /* Blanking off */
    WEX_BLANKSTATE_ON_gc           = (WEX_BLANKSTATE_ON_gv << WEX_BLANKSTATE_bp)   /* Blanking active */
} WEX_BLANKSTATE_t;

/* Blanking Trigger select bit group values */
typedef enum WEX_BLANKTRIG_VALUES_enum
{
    WEX_BLANKTRIG_NONE_gv          = 0x00,  /* No HW trigger (Software only) */
    WEX_BLANKTRIG_TCE0UPD_gv       = 0x04,  /* TCE0 Update Condition */
    WEX_BLANKTRIG_TCE0CMP0_gv      = 0x08,  /* TCE0 Compare 0 */
    WEX_BLANKTRIG_TCE0CMP1_gv      = 0x0C,  /* TCE0 Compare 1 */
    WEX_BLANKTRIG_TCE0CMP2_gv      = 0x10,  /* TCE0 Compare 2 */
    WEX_BLANKTRIG_TCE0CMP3_gv      = 0x14   /* TCE0 Compare 3 */
} WEX_BLANKTRIG_values_t;

/* Blanking Trigger select bit group configurations*/
typedef enum WEX_BLANKTRIG_enum
{
    WEX_BLANKTRIG_NONE_gc          = (WEX_BLANKTRIG_NONE_gv << WEX_BLANKTRIG_gp),  /* No HW trigger (Software only) */
    WEX_BLANKTRIG_TCE0UPD_gc       = (WEX_BLANKTRIG_TCE0UPD_gv << WEX_BLANKTRIG_gp),  /* TCE0 Update Condition */
    WEX_BLANKTRIG_TCE0CMP0_gc      = (WEX_BLANKTRIG_TCE0CMP0_gv << WEX_BLANKTRIG_gp),  /* TCE0 Compare 0 */
    WEX_BLANKTRIG_TCE0CMP1_gc      = (WEX_BLANKTRIG_TCE0CMP1_gv << WEX_BLANKTRIG_gp),  /* TCE0 Compare 1 */
    WEX_BLANKTRIG_TCE0CMP2_gc      = (WEX_BLANKTRIG_TCE0CMP2_gv << WEX_BLANKTRIG_gp),  /* TCE0 Compare 2 */
    WEX_BLANKTRIG_TCE0CMP3_gc      = (WEX_BLANKTRIG_TCE0CMP3_gv << WEX_BLANKTRIG_gp)   /* TCE0 Compare 3 */
} WEX_BLANKTRIG_t;

/* Command select bit group values */
typedef enum WEX_CMD_VALUES_enum
{
    WEX_CMD_NONE_gv                = 0x00,  /* No Command */
    WEX_CMD_UPDATE_gv              = 0x01,  /* Force update of Dead-time, SWAP and PGM buffer registers. */
    WEX_CMD_FAULTSET_gv            = 0x02,  /* Set Fault Detection */
    WEX_CMD_FAULTCLR_gv            = 0x03,  /* Clear Fault Detection */
    WEX_CMD_BLANKSET_gv            = 0x04,  /* Set SW Blanking */
    WEX_CMD_BLANKCLR_gv            = 0x05   /* Clear SW Blanking */
} WEX_CMD_values_t;

/* Command select bit group configurations*/
typedef enum WEX_CMD_enum
{
    WEX_CMD_NONE_gc                = (WEX_CMD_NONE_gv << WEX_CMD_gp),  /* No Command */
    WEX_CMD_UPDATE_gc              = (WEX_CMD_UPDATE_gv << WEX_CMD_gp),  /* Force update of Dead-time, SWAP and PGM buffer registers. */
    WEX_CMD_FAULTSET_gc            = (WEX_CMD_FAULTSET_gv << WEX_CMD_gp),  /* Set Fault Detection */
    WEX_CMD_FAULTCLR_gc            = (WEX_CMD_FAULTCLR_gv << WEX_CMD_gp),  /* Clear Fault Detection */
    WEX_CMD_BLANKSET_gc            = (WEX_CMD_BLANKSET_gv << WEX_CMD_gp),  /* Set SW Blanking */
    WEX_CMD_BLANKCLR_gc            = (WEX_CMD_BLANKCLR_gv << WEX_CMD_gp)   /* Clear SW Blanking */
} WEX_CMD_t;

/* Fault Detection Action select bit group values */
typedef enum WEX_FDACT_VALUES_enum
{
    WEX_FDACT_NONE_gv              = 0x00,  /* None. Fault Protection Disabled */
    WEX_FDACT_LOW_gv               = 0x01,  /* Drive all pins low */
    WEX_FDACT_CUSTOM_gv            = 0x03   /* Drive all pins to setting defined by FAULTDRV and FAULTVAL */
} WEX_FDACT_values_t;

/* Fault Detection Action select bit group configurations*/
typedef enum WEX_FDACT_enum
{
    WEX_FDACT_NONE_gc              = (WEX_FDACT_NONE_gv << WEX_FDACT_gp),  /* None. Fault Protection Disabled */
    WEX_FDACT_LOW_gc               = (WEX_FDACT_LOW_gv << WEX_FDACT_gp),  /* Drive all pins low */
    WEX_FDACT_CUSTOM_gc            = (WEX_FDACT_CUSTOM_gv << WEX_FDACT_gp)   /* Drive all pins to setting defined by FAULTDRV and FAULTVAL */
} WEX_FDACT_t;

/* Fault Detection on Debug Break Detection select bit group values */
typedef enum WEX_FDDBD_VALUES_enum
{
    WEX_FDDBD_FAULT_gv             = 0x00,  /* OCD Break request is treated as a fault if fault protection is enabled */
    WEX_FDDBD_IGNORE_gv            = 0x01   /* OCD Breask request will not trigger a fault */
} WEX_FDDBD_values_t;

/* Fault Detection on Debug Break Detection select bit group configurations*/
typedef enum WEX_FDDBD_enum
{
    WEX_FDDBD_FAULT_gc             = (WEX_FDDBD_FAULT_gv << WEX_FDDBD_bp),  /* OCD Break request is treated as a fault if fault protection is enabled */
    WEX_FDDBD_IGNORE_gc            = (WEX_FDDBD_IGNORE_gv << WEX_FDDBD_bp)   /* OCD Breask request will not trigger a fault */
} WEX_FDDBD_t;

